@chcp 963 >nul
@echo off
setlocal ENABLEDELAYEDEXPANSION
@mode con cols=80 lines=70
echo ==============================================================================
echo 		　　　注意！添加任务计划需要管理员权限！
echo ==============================================================================
echo.
echo 【按任意键继续】
pause >nul


schtasks /create /ru "System" /tn "Miyouzi_AP" /tr "%~dp0Miyouzi_AP【启用监控】.bat" /sc onstart
if %errorlevel%==0 (
	echo.	
	echo ==============================================================================
	echo 		　　任务计划添加成功！计划名：Miyouzi_AP
	echo.
	echo 		　　　　任务将在每次开机后后台运行
	echo.
	echo 　　　PS：批处理创建默认仅使用交流电才运行！你可以前往“任务计划”进行修改
	echo ==============================================================================
	) else (
	echo.	
	echo ==============================================================================
	echo 			　　　任务计划添加失败！
	echo.
	echo 		　　　　请检查是否以管理员方式运行！
	echo ==============================================================================
	)
echo 【按任意键继续】
pause >nul
exit